//              node if                  - запуск через термінал ≡

//! =================================================================================================================================
//* Задача: Перевірка на високосний рік
//* Напишіть функцію, яка приймає рік як аргумент і повертає булеве значення, що вказує, чи є цей рік високосним.

//* Умова для високосного року:
//*    Рік, що ділиться на 4 без залишку, є високосним, за винятком років, які діляться на 100 без залишку. Такі роки не є високосними, за винятком років, які діляться на 400 без залишку.
//*    Наприклад, 2000 рік був високосним, а 1900 рік - ні.

// function isLeapYear(year) {
//   if (year % 4 === 0) {
//     if (year % 100 === 0) {
//       if (year % 400 === 0) {
//         return true; // рік є високосним, бо ділиться на 400 без залишку
//       } else {
//         return false; // рік не є високосним, бо ділиться на 100 без залишку, але не на 400
//       }
//     } else {
//       return true; // рік є високосним, бо ділиться на 4 без залишку, але не на 100
//     }
//   } else {
//     return false; // рік не є високосним, бо не ділиться на 4 без залишку
//   }
// }

//?=================================================================================================================================
// function isLeapYear(year) {
//   if (year % 4 === 0) {
//     if (year % 100 === 0) {
//       return year % 400 === 0;
//     }
//     return true;
//   }
//   return false;
// }

//?=================================================================================================================================
// function isLeapYear(year) {
//   if ((year % 4 === 0 && year % 100 !== 0) || year % 400 === 0) {
//     return true;
//   }
//   return false;
// }

//?=================================================================================================================================
//* тернарний оператор

// function isLeapYear(year) {
//   return year % 4 === 0 && (year % 100 !== 0 || year % 400 === 0)
//     ? true
//     : false;
// }

//* використовується логічний оператор && для перевірки двох умов: чи ділиться рік на 4 без залишку і чи не ділиться він на 100 без залишку або ділиться на 400 без залишку.
//*  Якщо обидві умови виконуються, вираз повертає true, в іншому випадку - false.

//?=================================================================================================================================

// const isLeapYear = (year) =>
//   (year % 4 === 0 && year % 100 !== 0) || year % 400 === 0;

//?=================================================================================================================================

// console.log(isLeapYear(2000)); //  true
// console.log(isLeapYear(1900)); //  false
// console.log(isLeapYear(2020)); //  true
// console.log(isLeapYear(2021)); //  false
// console.log(isLeapYear(2100)); //  false
//! =================================================================================================================================
